protogia/avr-descriptionfiles-4-nim/svd/ATmega1284RFR2.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRX24</name>
      <description>Low-Power 2.4 GHz Transceiver</description>
      <baseAddress>0x000000BE</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4E</offset>
        <size>0x12</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7A</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7E</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x83</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x9C</offset>
        <size>0x16</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xB8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xBD</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC2</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x141</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AES_CTRL</name>
          <description>AES Control Register</description>
          <addressOffset>0x7E</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AES_IM</name>
              <description>AES Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_DIR</name>
              <description>Set AES Operation Direction</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_DIR_ENC</name>
                  <description>AES operation is encryption.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_DIR_DEC</name>
                  <description>AES operation is decryption.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_MODE</name>
              <description>Set AES Operation Mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES_MODE_ECB</name>
                  <description>AES Mode is ECB (Electronic Code Book).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_MODE_CBC</name>
                  <description>AES Mode is CBC (Cipher Block Chaining).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AES_REQUEST</name>
              <description>Request AES Operation.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_KEY</name>
          <description>AES Encryption and Decryption Key Buffer Register</description>
          <addressOffset>0x81</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AES_KEY</name>
              <description>AES Encryption/Decryption Key Buffer</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_STATE</name>
          <description>AES Plain and Cipher Text Buffer Register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AES_STATE</name>
              <description>AES Plain and Cipher Text Buffer</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_STATUS</name>
          <description>AES Status Register</description>
          <addressOffset>0x7F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AES_DONE</name>
              <description>AES Operation Finished with Success</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved</description>
              <bitRange>[6:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>AES_ER</name>
              <description>AES Operation Finished with Error</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANT_DIV</name>
          <description>Antenna Diversity Control Register</description>
          <addressOffset>0x8F</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ANT_CTRL</name>
              <description>Static Antenna Diversity Switch Control</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>Reserved</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANT_1</name>
                  <description>Antenna 1: DIG1=H, DIG2=L</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANT_0</name>
                  <description>Antenna 0: DIG1=L, DIG2=H</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANT_RESET</name>
                  <description>Default value for ANT_EXT_SW_EN=0; Mandatory setting for applications not using Antenna Diversity</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANT_EXT_SW_EN</name>
              <description>Enable External Antenna Switch Control</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANT_DIV_EXT_SW_DIS</name>
                  <description>Antenna Diversity RF switch control disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANT_DIV_EXT_SW_EN</name>
                  <description>Antenna Diversity RF switch control enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANT_DIV_EN</name>
              <description>Enable Antenna Diversity</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTENNA_DIVERSITY_ALGORITHM_DISABLED</name>
                  <description>Antenna Diversity algorithm disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTENNA_DIVERSITY_ALGORITHM_ENABLED</name>
                  <description>Antenna Diversity algorithm enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Res</name>
              <description>Reserved</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>7</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ANT_SEL</name>
              <description>Antenna Diversity Antenna Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANTENNA_0</name>
                  <description>Antenna 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANTENNA_1</name>
                  <description>Antenna 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BATMON</name>
          <description>Battery Monitor Control and Status Register</description>
          <addressOffset>0x93</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BATMON_VTH</name>
              <description>Battery Monitor Threshold Voltage</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2_550V_1_70V_BATMON_HR_1_0</name>
                  <description>2.550V / 1.70V (BATMON_HR=1/0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_625V_1_75V_BATMON_HR_1_0</name>
                  <description>2.625V / 1.75V (BATMON_HR=1/0)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_700V_1_80V_BATMON_HR_1_0</name>
                  <description>2.700V / 1.80V (BATMON_HR=1/0)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_775V_1_85V_BATMON_HR_1_0</name>
                  <description>2.775V / 1.85V (BATMON_HR=1/0)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_850V_1_90V_BATMON_HR_1_0</name>
                  <description>2.850V / 1.90V (BATMON_HR=1/0)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2_925V_1_95V_BATMON_HR_1_0</name>
                  <description>2.925V / 1.95V (BATMON_HR=1/0)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_000V_2_00V_BATMON_HR_1_0</name>
                  <description>3.000V / 2.00V (BATMON_HR=1/0)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_075V_2_05V_BATMON_HR_1_0</name>
                  <description>3.075V / 2.05V (BATMON_HR=1/0)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_150V_2_10V_BATMON_HR_1_0</name>
                  <description>3.150V / 2.10V (BATMON_HR=1/0)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_225V_2_15V_BATMON_HR_1_0</name>
                  <description>3.225V / 2.15V (BATMON_HR=1/0)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_300V_2_20V_BATMON_HR_1_0</name>
                  <description>3.300V / 2.20V (BATMON_HR=1/0)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_375V_2_25V_BATMON_HR_1_0</name>
                  <description>3.375V / 2.25V (BATMON_HR=1/0)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_450V_2_30V_BATMON_HR_1_0</name>
                  <description>3.450V / 2.30V (BATMON_HR=1/0)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_525V_2_35V_BATMON_HR_1_0</name>
                  <description>3.525V / 2.35V (BATMON_HR=1/0)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_600V_2_40V_BATMON_HR_1_0</name>
                  <description>3.600V / 2.40V (BATMON_HR=1/0)</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3_675V_2_45V_BATMON_HR_1_0</name>
                  <description>3.675V / 2.45V (BATMON_HR=1/0)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BATMON_HR</name>
              <description>Battery Monitor Voltage Range</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BATMON_HR_DIS</name>
                  <description>Enables the low range, see BATMON_VTH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BATMON_HR_EN</name>
                  <description>Enables the high range, see BATMON_VTH</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BATMON_OK</name>
              <description>Battery Monitor Status</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THE_BATTERY_VOLTAGE_IS_BELOW_THE_THRESHOLD</name>
                  <description>The battery voltage is below the threshold.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THE_BATTERY_VOLTAGE_IS_ABOVE_THE_THRESHOLD</name>
                  <description>The battery voltage is above the threshold.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BAT_LOW_EN</name>
              <description>Battery Monitor Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BAT_LOW</name>
              <description>Battery Monitor Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCA_THRES</name>
          <description>Transceiver CCA Threshold Setting Register</description>
          <addressOffset>0x8B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCA_ED_THRES</name>
              <description>ED Threshold Level for CCA Measurement</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CCA_CS_THRES</name>
              <description>CS Threshold Level for CCA Measurement</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_CTRL_0</name>
          <description>Channel Control Register 0</description>
          <addressOffset>0x95</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CC_NUMBER</name>
              <description>Channel Number</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CC_CTRL_1</name>
          <description>Channel Control Register 1</description>
          <addressOffset>0x96</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CC_BAND</name>
              <description>Channel Band</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>CSMA_BE</name>
          <description>Transceiver CSMA-CA Back-off Exponent Control Register</description>
          <addressOffset>0xB1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MIN_BE</name>
              <description>Minimum Back-off Exponent</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINIMUM_VALUE_OF_MINIMUM_BACK_OFF_EXPONENT</name>
                  <description>Minimum value of minimum back-off exponent.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>...</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXIMUM_VALUE_OF_MINIMUM_BACK_OFF_EXPONENT_MIN_BE_MUST_BE_SMALLER_OR_EQUAL_TO_MAX_BE</name>
                  <description>Maximum value of minimum back-off exponent. MIN_BE must be smaller or equal to MAX_BE.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAX_BE</name>
              <description>Maximum Back-off Exponent</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THIS_VALUE_IS_NOT_VALID_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT</name>
                  <description>This value is not valid for the maximum back-off exponent.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINIMUM_IEEE_COMPLIANT_VALUE_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT</name>
                  <description>Minimum, IEEE compliant value for the maximum back-off exponent.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESERVED</name>
                  <description>...</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAXIMUM_IEEE_COMPLIANT_VALUE_FOR_THE_MAXIMUM_BACK_OFF_EXPONENT</name>
                  <description>Maximum, IEEE compliant value for the maximum back-off exponent.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
